// CulturalPlanner full code with obstacle selection feature
import React, {
  useState,
  useMemo,
  useEffect,
  useRef,
  useLayoutEffect
} from 'react';
import {
  View,
  Text,
  StyleSheet,
  TouchableOpacity,
  Alert,
  ActivityIndicator,
  Dimensions,
  PanResponder,
  Animated,
  Modal,
  Pressable
} from 'react-native';
import AsyncStorage from '@react-native-async-storage/async-storage';
import { useNavigation, useRoute } from '@react-navigation/native';
import { database } from '../../firebaseConfig';
import {
  ref,
  remove,
  set,
  push,
  get,
  update
} from 'firebase/database';
import { Ionicons } from '@expo/vector-icons';
import { SvgXml, Svg, Rect } from 'react-native-svg';

const apiData = {
  actions: [
    {
      action: 'move',
      building: 'Ратуша',
      from: 'M5:P7',
      to: 'K7:N9',
      description: 'Змістити Ратушу в центр поселення.',
      reason:
        'Центральне розміщення мінімізує витрати на дороги для підключення інших будівель.'
    },
    {
      action: 'build',
      building: 'Халупа',
      location: 'I5:J6',
      count: 1,
      description: 'Побудувати халупу.',
      reason: 'Для виконання завдання 1 і створення базового населення.'
    },
    {
      action: 'build',
      building: 'Халупа',
      location: 'L5:M6',
      count: 1,
      description: 'Побудувати халупу.',
      reason: 'Для виконання завдання 1 і створення базового населення.'
    },
    {
      action: 'build',
      building: 'Халупа',
      location: 'O5:P6',
      count: 1,
      description: 'Побудувати халупу.',
      reason: 'Для виконання завдання 1 і створення базового населення.'
    },
    {
      action: 'build',
      building: 'Дорога',
      location: 'J7',
      count: 1,
      description: 'Прокласти дорогу для підключення халуп.',
      reason: 'Будівлі не функціонують без підключення до Ратуші.'
    },
    {
      action: 'build',
      building: 'Дорога',
      location: 'N6',
      count: 1,
      description: 'Прокласти дорогу для підключення халуп.',
      reason: 'Будівлі не функціонують без підключення до Ратуші.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'I7',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Для виконання завдання 2.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'K5',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Для виконання завдання 2.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'K6',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Для виконання завдання 2.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'N5',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Для виконання завдання 2.'
    },
    {
      action: 'build',
      building: 'Кузня сокир',
      location: 'I10:K12',
      description: 'Побудувати Кузню сокир.',
      reason: 'Для виконання завдання 3.'
    },
    {
      action: 'build',
      building: 'Дорога',
      location: 'L10',
      count: 1,
      description: 'Прокласти дорогу до Кузні сокир.',
      reason: 'Кузня потребує підключення до Ратуші.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'O7',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Отримати 60 дипломатії для виконання завдання 4.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'P7',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Отримати 60 дипломатії для виконання завдання 4.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'O8',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Отримати 60 дипломатії для виконання завдання 4.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'P8',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Отримати 60 дипломатії для виконання завдання 4.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'O9',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Отримати 60 дипломатії для виконання завдання 4.'
    },
    {
      action: 'build',
      building: 'Рунний камінь',
      location: 'P9',
      count: 1,
      description: 'Побудувати рунний камінь.',
      reason: 'Отримати 60 дипломатії для виконання завдання 4.'
    },
    {
      action: 'destroy',
      building: 'Рунний камінь',
      location: 'O7',
      count: 1,
      description: 'Знести рунний камінь.',
      reason: 'Дипломатія зарахована, а будівлі більше не потрібні.'
    },
    {
      action: 'destroy',
      building: 'Рунний камінь',
      location: 'P7',
      count: 1,
      description: 'Знести рунний камінь.',
      reason: 'Дипломатія зарахована, а будівлі більше не потрібні.'
    },
    {
      action: 'destroy',
      building: 'Рунний камінь',
      location: 'O8',
      count: 1,
      description: 'Знести рунний камінь.',
      reason: 'Дипломатія зарахована, а будівлі більше не потрібні.'
    },
    {
      action: 'destroy',
      building: 'Рунний камінь',
      location: 'P8',
      count: 1,
      description: 'Знести рунний камінь.',
      reason: 'Дипломатія зарахована, а будівлі більше не потрібні.'
    },
    {
      action: 'destroy',
      building: 'Рунний камінь',
      location: 'O9',
      count: 1,
      description: 'Знести рунний камінь.',
      reason: 'Дипломатія зарахована, а будівлі більше не потрібні.'
    },
    {
      action: 'destroy',
      building: 'Рунний камінь',
      location: 'P9',
      count: 1,
      description: 'Знести рунний камінь.',
      reason: 'Дипломатія зарахована, а будівлі більше не потрібні.'
    },
    {
      action: 'build',
      building: 'Халупа',
      location: 'I8:J9',
      count: 1,
      description: 'Побудувати халупу.',
      reason:
        'Збільшення населення для будівництва ще однієї Кузні сокир.'
    },
    {
      action: 'build',
      building: 'Халупа',
      location: 'O7:P8',
      count: 1,
      description: 'Побудувати халупу.',
      reason:
        'Збільшення населення для будівництва ще однієї Кузні сокир.'
    },
    {
      action: 'build',
      building: 'Халупа',
      location: 'L11:M12',
      count: 1,
      description: 'Побудувати халупу.',
      reason:
        'Збільшення населення для будівництва ще однієї Кузні сокир.'
    },
    {
      action: 'build',
      building: 'Дорога',
      location: 'O9',
      count: 1,
      description: 'Прокласти дорогу до халупи L11:M12.',
      reason: 'Підключення нової житлової будівлі до Ратуші.'
    },
    {
      action: 'build',
      building: 'Кузня сокир',
      location: 'N10:P12',
      description: 'Побудувати другу Кузню сокир.',
      reason: 'Збільшення темпу виробництва сокир.',
      completion_time: 1751186100
    }
  ]
};

const initialQuestline = {
  0: 'Побудувати 3 халупи.',
  1: 'Побудувати 4 рунних каменя.',
  2: 'Побудувати кузню сокир.',
  3: 'Мати 55 очок дипломатії або зібрати 20 сокир.',
  4: 'Побудувати 2 святині.',
  5: 'Побудувати медоварню',
  6: 'Отримати 195 очок дипломатії або зібрати 30 бутлів меду.',
  7: 'Отримати 2 хатини.',
  8: 'Отримати 280 очок дипломатії або зібрати 40 сокир.',
  9: 'Отримати мисливця на звірів.',
  10: 'Отримати 375 очок дипломатії або зібрати 50 рогів',
  11: 'Отримати 4 тотеми клану або зібрати 50 бутлів меду.',
  12: 'Побудувати 4 тотеми клану або зібрати 50  меду.',
  13: 'Мати 595 очок дипломатії або зібрати 60 рогів.',
  14: 'Отримати вовняну ферму.',
  15: 'Отримати 855 очок дипломатії або зібрати 60 тюків вовни.',
  16: 'Мати 720 очок дипломатії або зібрати 60 вовни.',
  17: 'Побудувати стару вербу',
  18: 'Побудувати медову залу.',
  19: 'Зібрати 2500 монет і по 10 кожного товару'
};

const AnimatedRect = Animated.createAnimatedComponent(Rect);

const buildingTypes = {
  'Халупа': 'residential',
  'Рунний камінь': 'diplomatic',
  'Кузня сокир': 'production',
  'Дорога': 'road'
};

const buildingColors = {
  residential: '#a200ec',
  diplomatic: '#0080ec',
  production: '#2bff2e',
  road: '#a8a8a8'
};


const vikingMapXml = `<svg
   width="239.99976mm"
   height="200mm"
   viewBox="0 0 239.99976 200"
   xmlns="http://www.w3.org/2000/svg"
>
  <g
     id="E1:H4"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(40.082945,0.08294468)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_E1"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="H4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="G2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="F2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="E2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="H1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="G1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="F1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="E1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="I1:L4"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(80.082945,0.08294468)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_I1"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="L4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="K2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="J2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="I2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="L1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="K1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="J1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="I1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="M1:P4"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(120.08294,0.08294468)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_M1"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="P4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="O2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="N2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="M2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="P1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="O1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="N1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="M1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="Q1:T4"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(160.08294,0.08294468)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_Q1"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="T4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q4"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q3"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="S2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="R2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="Q2"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="T1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="S1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="R1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="Q1"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="A5:D8"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(0.08294468,40.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_A5"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="D8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="C8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="B8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="A8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="D7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="C7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="B7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="A7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="D6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="C6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="B6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="A6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="D5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="C5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="B5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="A5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="E5:H8"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(40.082945,40.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_E5"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="H8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="G6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="F6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="E6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="H5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="G5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="F5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="E5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="I5:L8"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(80.082945,40.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_I5"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="L8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="K6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="J6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="I6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="L5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="K5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="J5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="I5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="M5:P8"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(120.08294,40.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_N5"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="P8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M8"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M7"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="O6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="N6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="M6"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="P5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="O5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="N5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="M5"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="Q5:T8"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(160.08294,40.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_Q5"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="T8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q8"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q7"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="S6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="R6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="Q6"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="T5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="S5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="R5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="Q5"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="A9:D12"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(0.08294468,80.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_A9"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="D12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="C12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="B12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="A12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="D11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="C11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="B11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="A11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="D10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="C10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="B10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="A10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="D9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="C9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="B9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="A9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="E9:H12"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(40.082945,80.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_E9"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="H12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="G10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="F10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="E10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="H9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="G9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="F9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="E9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="I9:L12"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(80.082945,80.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_I9"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="L12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="K10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="J10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="I10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="L9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="K9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="J9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="I9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="M9:P12"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(120.08294,80.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_M9"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="P12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M12"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M11"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="O10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="N10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="M10"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="P9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="O9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="N9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="M9"
       style="fill:#fff;fill-opacity:1;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="Q9:T12"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(160.08294,80.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_Q9"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="T12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="S10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="R10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="Q10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="T9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="S9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="R9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="Q9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="U9:X12"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(200.08294,80.082945)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_U9"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="X12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="W12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="V12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="U12"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="X11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="W11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="V11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="U11"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="X110"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="W10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="V10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="U10"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="X9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="W9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="V9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="U9"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="A13:D16"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(0.08294468,120.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_A13"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="D16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="C16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="B16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="A16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="D15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="C15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="B15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="A15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="D14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="C14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="B14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="A14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="D13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="C13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="B13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="A13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="E13:H16"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(40.082945,120.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_E13"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="H16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="G14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="F14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="E14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="H13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="G13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="F13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="E13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="I13:L16"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(80.082945,120.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_I13"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="L16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="K14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="J14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="I14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="L13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="K13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="J13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="I13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="M13:P16"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(120.08294,120.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_M13"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="P16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="O14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="N14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="M14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="P13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="O13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="N13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="M13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="Q13:T16"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(160.08294,120.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_Q13"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="T16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="S14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="R14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="Q14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="T13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="S13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="R13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="Q13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="U13:X16"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(200.08294,120.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_U13"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="X16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="W16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="V16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="U16"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="X15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="W15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="V15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="U15"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="X14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="W14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="V14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="U14"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="X13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="W13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="V13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="U13"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="E17:H20"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(40.082945,160.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_E17"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="H20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="G19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="F19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="E19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="H18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="G18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="F18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="E18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="H17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="G17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="F17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="E17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="I17:L20"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(80.082945,160.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_I17"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="L20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="K19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="J19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="I19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="L18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="K18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="J18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="I18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="L17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="K17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="J17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="I17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="M17:P20"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(120.08294,160.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_M17"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="P20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="O19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="N19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="M19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="P18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="O18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="N18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="M18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="P17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="O17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="N17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="M17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
  <g
     id="Q17:T20"
     style="stroke-width:0.3;stroke-dasharray:none"
     transform="translate(160.08294,160.08294)">
    <rect
       style="fill:#ffffff;fill-opacity:1;stroke:#000000;stroke-width:0.297767;stroke-dasharray:none;stroke-opacity:1"
       id="bord_Q17"
       width="39.702"
       height="39.702232"
       x="0.06593883"
       y="0.06593883" />
    <path
       id="T20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398"
       d="m 30.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,39.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,39.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q20"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,39.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="S19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,29.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="R19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,29.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="Q19"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,29.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425782 0,9.638672 z" />
    <path
       id="T18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="S18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,19.736328 c 3.212891,0 6.425782,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z"
       transform="translate(1.25e-6)" />
    <path
       id="R18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,19.736328 c 3.212891,0 6.425781,0 9.638672,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.212891,0 -6.425781,0 -9.638672,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="Q18"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,19.736328 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.212891 0,-6.425781 0,-9.638672 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.212891 0,6.425781 0,9.638672 z" />
    <path
       id="T17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 30.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="S17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 20.097656,9.7363281 c 3.212891,0 6.425782,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="R17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 10.097656,9.7363281 c 3.212891,0 6.425781,0 9.638672,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.212891,0 -6.425781,0 -9.638672,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
    <path
       id="Q17"
       style="fill:#fffc2b;stroke:#000000;stroke-width:0.0969398;stroke-dasharray:none"
       d="m 0.09765625,9.7363281 c 3.21289065,0 6.42578125,0 9.63867185,0 0,-3.2128906 0,-6.4257812 0,-9.63867185 -3.2128906,0 -6.4257812,0 -9.63867185,0 0,3.21289065 0,6.42578125 0,9.63867185 z" />
  </g>
</svg>
`;
const CulturalPlanner = () => {
  const navigation = useNavigation();
  const route = useRoute();
  const settlementName = route.params?.settlementName;
  const start = route.params?.start;

  const { width: screenWidth } = Dimensions.get('window');
  const ratio = 1.2; // Відношення ширини до висоти оригінальної карти
  const scale = 1 / 0.75; // Масштаб, щоб видимою була приблизно 75%
  const containerWidth = screenWidth;
  const containerHeight = containerWidth / ratio;
const mapWidth = containerWidth * scale;
const mapHeight = mapWidth / ratio;
const initialX = -((mapWidth - containerWidth) / 2);
const initialY = -((mapHeight - containerHeight) / 2);

const factor = mapWidth / 239.99976;

  const containerRef = useRef(null);
  const containerOffset = useRef({ x: 0, y: 0 });
  const handleContainerLayout = () => {
    containerRef.current?.measure((x, y, width, height, pageX, pageY) => {
      containerOffset.current = { x: pageX, y: pageY };
    });
  };

  const cellSize = 9.638672;

const cellPositions = useMemo(() => {
    const positions = {};
    const groupRegex = /<g[^>]*id="([^"]+)"[^>]*transform="translate\(([^,]+),([^)]+)\)"[^>]*>/g;
    let match;
    while ((match = groupRegex.exec(vikingMapXml)) !== null) {
      const groupId = match[1];
      const gX = parseFloat(match[2]);
      const gY = parseFloat(match[3]);
      const start = match.index + match[0].length;
      const end = vikingMapXml.indexOf('</g>', start);
      const block = vikingMapXml.slice(start, end);
      const pathRegex = /<path[^>]*id="([A-Z]\d+)"[^>]*d="m ([0-9.]+),([0-9.]+)/g;
      let p;
      while ((p = pathRegex.exec(block)) !== null) {
        const id = p[1];
        const x = parseFloat(p[2]);
        const y = parseFloat(p[3]);
        positions[id] = { x: gX + x, y: gY + y, group: groupId };
      }
      groupRegex.lastIndex = end + 4;
    }
    return positions;
}, []);

const cellGroupMap = useMemo(() => {
  const map = {};
  Object.entries(cellPositions).forEach(([id, data]) => {
    map[id] = data.group;
  });
  return map;
}, [cellPositions]);

const GROUP_BOUNDS_RAW = {
  'E1:H4': { x: 40.18060125, y: 0.18060078000000068, width: 39.63867174999999, height: 39.6386719 },
  'I1:L4': { x: 80.18060125, y: 0.18060078000000068, width: 39.63867175, height: 39.6386719 },
  'M1:P4': { x: 120.18059625, y: 0.18060078000000068, width: 39.63867174999997, height: 39.6386719 },
  'Q1:T4': { x: 160.18059625, y: 0.18060078000000068, width: 39.638671750000015, height: 39.6386719 },
  'A5:D8': { x: 0.18060093, y: 40.180601100000004, width: 39.63867175, height: 39.638671900000006 },
  'E5:H8': { x: 40.18060125, y: 40.180601100000004, width: 39.63867174999999, height: 39.638671900000006 },
  'I5:L8': { x: 80.18060125, y: 40.180601100000004, width: 39.63867175, height: 39.638671900000006 },
  'M5:P8': { x: 120.18059625, y: 40.180601100000004, width: 39.63867174999997, height: 39.638671900000006 },
  'Q5:T8': { x: 160.18059625, y: 40.180601100000004, width: 39.638671750000015, height: 39.638671900000006 },
  'A9:D12': { x: 0.18060093, y: 80.18060109999999, width: 39.63867175, height: 39.638671900000006 },
  'E9:H12': { x: 40.18060125, y: 80.18060109999999, width: 39.63867174999999, height: 39.638671900000006 },
  'I9:L12': { x: 80.18060125, y: 80.18060109999999, width: 39.63867175, height: 39.638671900000006 },
  'M9:P12': { x: 120.18059625, y: 80.18060109999999, width: 39.63867174999997, height: 39.638671900000006 },
  'Q9:T12': { x: 160.18059625, y: 80.18060109999999, width: 39.638671750000015, height: 39.638671900000006 },
  'U9:X12': { x: 200.18059625, y: 80.18060109999999, width: 39.638671750000015, height: 39.638671900000006 },
  'A13:D16': { x: 0.18060093, y: 120.18059609999999, width: 39.63867175, height: 39.638671900000006 },
  'E13:H16': { x: 40.18060125, y: 120.18059609999999, width: 39.63867174999999, height: 39.638671900000006 },
  'I13:L16': { x: 80.18060125, y: 120.18059609999999, width: 39.63867175, height: 39.638671900000006 },
  'M13:P16': { x: 120.18059625, y: 120.18059609999999, width: 39.63867174999997, height: 39.638671900000006 },
  'Q13:T16': { x: 160.18059625, y: 120.18059609999999, width: 39.638671750000015, height: 39.638671900000006 },
  'U13:X16': { x: 200.18059625, y: 120.18059609999999, width: 39.638671750000015, height: 39.638671900000006 },
  'E17:H20': { x: 40.18060125, y: 160.1805961, width: 39.63867174999999, height: 39.63867190000002 },
  'I17:L20': { x: 80.18060125, y: 160.1805961, width: 39.63867175, height: 39.63867190000002 },
  'M17:P20': { x: 120.18059625, y: 160.1805961, width: 39.63867174999997, height: 39.63867190000002 },
  'Q17:T20': { x: 160.18059625, y: 160.1805961, width: 39.638671750000015, height: 39.63867190000002 }
};

const groupBounds = useMemo(() => {
  const bounds = {};
  Object.entries(GROUP_BOUNDS_RAW).forEach(([range, rect]) => {
    bounds[range] = {
      left: rect.x * factor,
      top: rect.y * factor,
      right: (rect.x + rect.width) * factor,
      bottom: (rect.y + rect.height) * factor
    };
  });
  return bounds;
}, [factor]);

const getGroupByCoords = (x, y) => {
  for (const [group, b] of Object.entries(groupBounds)) {
    if (x >= b.left && x <= b.right && y >= b.top && y <= b.bottom) {
      return group;
    }
  }
  return null;
};

const COLUMN_META = [
  { label: 'A:D', start: 0.18060093 },
  { label: 'E:H', start: 40.18060125 },
  { label: 'I:L', start: 80.18060125 },
  { label: 'M:P', start: 120.18059625 },
  { label: 'Q:T', start: 160.18059625 },
  { label: 'U:X', start: 200.18059625 }
];

const ROW_META = [
  { label: '1:4', start: 0.18060078000000068 },
  { label: '5:8', start: 40.180601100000004 },
  { label: '9:12', start: 80.18060109999999 },
  { label: '13:16', start: 120.18059609999999 },
  { label: '17:20', start: 160.1805961 }
];

const SECTOR_WIDTH = 39.6386717;
const SECTOR_HEIGHT = 39.6386719;

const IGNORED_SECTORS = new Set([
  'A1:D4',
  'U1:X4',
  'U5:X8',
  'A17:D20',
  'U17:X20',
  'I5:L8',
  'M5:P8',
  'I9:L12',
  'M9:P12'
]);

const getColumnRowFromCoords = (x, y) => {
  const originalX = x / factor;
  const originalY = y / factor;

  const column = Math.floor(originalX / 40);
  const row = Math.floor(originalY / 40);

  return { column, row };
};

const getExcelRange = (columnIndex, rowIndex) => {
  const columnLabel = COLUMN_META[columnIndex]?.label;
  const rowLabel = ROW_META[rowIndex]?.label;
  if (!columnLabel || !rowLabel) return null;
  const [colStart, colEnd] = columnLabel.split(':');
  const [rowStart, rowEnd] = rowLabel.split(':');
  return `${colStart}${rowStart}:${colEnd}${rowEnd}`;
};

function parseRange(range) {
   const clean = range.trim().toUpperCase();
   if (/^[A-Z]\d+$/.test(clean)) {
     const pos = cellPositions[clean];
     if (!pos) return null;
     const topLeft = { x: pos.x, y: pos.y - cellSize };
     const bottomRight = { x: pos.x + cellSize, y: pos.y };
     return {
       x: topLeft.x * factor,
       y: topLeft.y * factor,
       width: (bottomRight.x - topLeft.x) * factor,
       height: (bottomRight.y - topLeft.y) * factor
     };
   }
   const match = clean.match(/^([A-Z]\d+):([A-Z]\d+)$/);
   if (!match) return null;
   const startPos = cellPositions[match[1]];
   const endPos = cellPositions[match[2]];
   if (!startPos || !endPos) return null;
   const startTop = { x: startPos.x, y: startPos.y - cellSize };
   const endBottom = { x: endPos.x + cellSize, y: endPos.y };
  return {
    x: startTop.x * factor,
    y: startTop.y * factor,
    width: (endBottom.x - startTop.x) * factor,
    height: (endBottom.y - startTop.y) * factor
  };
}

const getGroupSvgXml = groupId => {
  if (!groupId) return null;
  const regex = new RegExp(`<g[^>]*id="${groupId}"[^>]*>[\\s\\S]*?<\\/g>`);
  const match = vikingMapXml.match(regex);
  if (!match) return null;
  let group = match[0];
  const transRegex = /transform="translate\(([^,]+),([^)]+)\)"/;
  group = group.replace(transRegex, '');

  const rect = group.match(/<rect[^>]*width="([0-9.]+)"[^>]*height="([0-9.]+)"[^>]*x="([0-9.]+)"[^>]*y="([0-9.]+)"[^>]*>/);
  if (rect) {
    const width = parseFloat(rect[1]) + parseFloat(rect[3]);
    const height = parseFloat(rect[2]) + parseFloat(rect[4]);
    return `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 ${width} ${height}">${group}</svg>`;
  }

  return `<svg xmlns="http://www.w3.org/2000/svg">${group}</svg>`;
};

const actions = apiData.actions;
const initialFromRect = parseRange(actions[0].from);
const [currentActionIndex, setCurrentActionIndex] = useState(0);
const currentActionIndexRef = useRef(0);

const { minX, minY, cellIndex } = useMemo(() => {
  let minX = Infinity;
  let minY = Infinity;
  Object.values(cellPositions).forEach((pos) => {
    if (pos.x < minX) minX = pos.x;
    if (pos.y < minY) minY = pos.y;
  });
  // Побудова індексу для швидкого пошуку клітин за координатами
  const index = {};
  Object.entries(cellPositions).forEach(([id, pos]) => {
    const col = Math.floor((pos.x - minX) / cellSize);
    const row = Math.floor((pos.y - minY) / cellSize);
    index[`${col},${row}`] = id;
  });
  return { minX, minY, cellIndex: index };
}, [cellPositions]);

const getCellByCoords = (x, y) => {
  const col = Math.floor((x - minX * factor) / (cellSize * factor));
  const row = Math.floor((y - minY * factor) / (cellSize * factor));
  return cellIndex[`${col},${row}`] ?? null;
};

const [obstacleMode, setObstacleMode] = useState(null);
const obstacleModeRef = useRef(null);
const [obstacleModalVisible, setObstacleModalVisible] = useState(false);
const [selectedSector, setSelectedSector] = useState(null);
const [modalSvgSize, setModalSvgSize] = useState({ width: 0, height: 0 });

const handleModalPress = e => {
  if (!selectedSector) return;
  const { locationX, locationY } = e.nativeEvent;
  if (!modalSvgSize.width || !modalSvgSize.height) return;
  const match = selectedSector.match(/^([A-Z])(\d+):/);
  if (!match) return;
  const startCol = match[1].charCodeAt(0);
  const startRow = parseInt(match[2], 10);
  const colOffset = Math.min(
    3,
    Math.floor((locationX / modalSvgSize.width) * 4)
  );
  const rowOffset = Math.min(
    3,
    Math.floor((locationY / modalSvgSize.height) * 4)
  );
  if (colOffset === 3 || rowOffset === 3) return;
  if (!obstacleModeRef.current) return;
  const cellId = `${String.fromCharCode(startCol + colOffset)}${startRow + rowOffset}`;
  console.log(`тап по квадрату '${cellId}'`);
  Alert.alert(`Квадрат ${cellId}`);
};
useEffect(() => {
  obstacleModeRef.current = obstacleMode;
}, [obstacleMode]);
useEffect(() => {
  currentActionIndexRef.current = currentActionIndex;
}, [currentActionIndex]);

  useEffect(() => {
    if (!start) return;
    (async () => {
      try {
        const userId = await AsyncStorage.getItem('userId');
        const guildId = await AsyncStorage.getItem('guildId');
        const basePath = `guilds/${guildId}/guildUsers/${userId}/culturalSettlements`;
        await set(ref(database, basePath), {
          settlementName,
          questline: initialQuestline,
          availableBuildings: [
            {
              name: 'Халупа',
              type: 'residential',
              size: '2x2',
              population: 16,
              produces: 'мідні монети',
              production: { '5h': 108 },
              requires_road: true
            },
            {
              name: 'Рунний камінь',
              type: 'diplomatic',
              size: '1x1',
              diplomacy: 6,
              requires_road: false
            },
            {
              name: 'Кузня сокир',
              type: 'production',
              size: '3x3',
              population: 45,
              produces: 'сокири',
              production: { '5h': 5, '10h': 10, '20h': 20 },
              requires_road: true
            }
          ]
        });
        const buildingRef = push(ref(database, `${basePath}/constructedBuildings`));
        await set(buildingRef, {
          name: 'Ратуша',
          type: 'Town Hall',
          cellRange: 'M5:P7'
        });
      } catch (e) {
        console.error(e);
      }
    })();
  }, [start, settlementName]);

  const [moveRect, setMoveRect] = useState(
    initialFromRect ? { width: initialFromRect.width, height: initialFromRect.height } : null
  );
  const [staticRect, setStaticRect] = useState(null);
  const [buildRects, setBuildRects] = useState([]);
  const [finalizedRects, setFinalizedRects] = useState([]);
  const buildOpacity = useRef(new Animated.Value(0)).current;
  const animatedPos = useRef(
    new Animated.ValueXY(
      initialFromRect ? { x: initialFromRect.x, y: initialFromRect.y } : { x: 0, y: 0 }
    )
  ).current;
  const animationRef = useRef(null);

  const pan = React.useRef(new Animated.ValueXY({ x: initialX, y: initialY })).current;
  const offset = React.useRef({ x: initialX, y: initialY });
  const clamp = (val, min, max) => Math.max(min, Math.min(val, max));

  const panResponder = React.useRef(
    PanResponder.create({
      onStartShouldSetPanResponder: () => true,
      onPanResponderMove: (_, gesture) => {
        const newX = clamp(offset.current.x + gesture.dx, containerWidth - mapWidth, 0);
        const newY = clamp(offset.current.y + gesture.dy, containerHeight - mapHeight, 0);
        pan.setValue({ x: newX, y: newY });
      },
      onPanResponderRelease: (evt, gesture) => {
        const newX = clamp(offset.current.x + gesture.dx, containerWidth - mapWidth, 0);
        const newY = clamp(offset.current.y + gesture.dy, containerHeight - mapHeight, 0);
        offset.current = { x: newX, y: newY };
        pan.setValue(offset.current);

        if (Math.abs(gesture.dx) < 5 && Math.abs(gesture.dy) < 5) {
          const { pageX, pageY } = evt.nativeEvent;
          const adjustedX =
            pageX - containerOffset.current.x - offset.current.x;
          const adjustedY =
            pageY - containerOffset.current.y - offset.current.y;
          const { column, row } = getColumnRowFromCoords(adjustedX, adjustedY);
          const excelRange = getExcelRange(column, row);
          if (excelRange && !IGNORED_SECTORS.has(excelRange)) {
            console.log(`тап відбувся в секторі '${excelRange}'`);
            setSelectedSector(excelRange);
            if (currentActionIndexRef.current >= actions.length) {
              setObstacleModalVisible(true);
            }
          } else {
            console.log('тап у стовпчику', column, 'рядку', row);
          }
        }
      }
    })
  ).current;

  // Поки не завантажився settlementName, показуємо лоадер
  if (!settlementName) {
    return (
      <View style={styles.loader}>
        <ActivityIndicator size="large" />
      </View>
    );
  }



  // Видалити запис у Firebase і повернутися до вибору поселення
  const clearAndBack = async () => {
    const userId = await AsyncStorage.getItem('userId');
    const guildId = await AsyncStorage.getItem('guildId');
    await remove(
      ref(
        database,
        `guilds/${guildId}/guildUsers/${userId}/culturalSettlements`
      )
    );
    navigation.replace('CulturalSettlements');
  };

  // Обробник закриття екрана
  const onClose = () => {
    if (start) {
      clearAndBack();
    } else {
      Alert.alert(
        'Підтвердження',
        'Ви дійсно хочете закінчити планування культурного поселення і видалити весь прогрес?',
        [
          { text: 'Ні' },
          { text: 'Так', onPress: clearAndBack }
        ]
      );
    }
  };

  // Налаштовуємо заголовок і кнопки у шапці
  React.useLayoutEffect(() => {
    navigation.setOptions({
      headerTitle: `План поселення: ${settlementName}`,
      headerLeft: () => (
        <TouchableOpacity
          onPress={() => navigation.getParent()?.goBack()}
          style={{ marginLeft: 10 }}
        >
          <Ionicons name="arrow-back" size={24} color="#fff" />
        </TouchableOpacity>
      ),
      headerRight: () => (
        <TouchableOpacity onPress={onClose} style={{ marginRight: 10 }}>
          <Ionicons name="close" size={24} color="#fff" />
        </TouchableOpacity>
      )
    });
  }, [navigation, settlementName, start]);


  const handleDone = async () => {
    const action = actions[currentActionIndex];
    if (action?.action === 'move' && moveRect) {
      if (animationRef.current) animationRef.current.stop();
      const toRect = parseRange(action.to);
      if (toRect) {
        animatedPos.setValue({ x: toRect.x, y: toRect.y });
        setStaticRect({ x: toRect.x, y: toRect.y, width: toRect.width, height: toRect.height });
        setMoveRect(null);
        try {
          const userId = await AsyncStorage.getItem('userId');
          const guildId = await AsyncStorage.getItem('guildId');
          const basePath = `guilds/${guildId}/guildUsers/${userId}/culturalSettlements/constructedBuildings`;
          const snap = await get(ref(database, basePath));
          if (snap.exists()) {
            const constructedBuildings = snap.val();
            const updates = {};
            const collectUpdates = (node, path) => {
              if (node && typeof node === 'object') {
                if (node.cellRange === action.from) {
                  updates[`${path}/cellRange`] = action.to;
                }
                Object.keys(node).forEach(key => {
                  const childPath = path ? `${path}/${key}` : key;
                  collectUpdates(node[key], childPath);
                });
              }
            };
            collectUpdates(constructedBuildings, '');
            if (Object.keys(updates).length > 0) {
              await update(ref(database, basePath), updates);
            }
          }
        } catch (e) {
          console.error(e);
        }
      }
    }
    if (action?.action === 'build' && buildRects.length > 0) {
      if (animationRef.current) animationRef.current.stop();
      const type = buildingTypes[action.building] || 'residential';
      const color = buildingColors[type] || '#4b0082';
      const finalized = buildRects.map(r => ({ ...r, color }));
      setFinalizedRects(prev => [...prev, ...finalized]);
      try {
        const userId = await AsyncStorage.getItem('userId');
        const guildId = await AsyncStorage.getItem('guildId');
        const basePath = `guilds/${guildId}/guildUsers/${userId}/culturalSettlements/constructedBuildings`;
        const cellRange = action.location || (action.locations ? action.locations.join(',') : '');
        const buildingRef = push(ref(database, basePath));
        await set(buildingRef, {
          name: action.building,
          type,
          cellRange
        });

        const questlinePath = `guilds/${guildId}/guildUsers/${userId}/culturalSettlements/questline`;
        if (action.building === 'Халупа' && cellRange === 'O5:P6') {
          await remove(ref(database, `${questlinePath}/0`));
        } else if (action.building === 'Рунний камінь' && cellRange === 'N5') {
          await remove(ref(database, `${questlinePath}/1`));
        } else if (action.building === 'Кузня сокир' && cellRange === 'I10:K12') {
          await remove(ref(database, `${questlinePath}/2`));
        } else if (action.building === 'Рунний камінь' && cellRange === 'P9') {
          await remove(ref(database, `${questlinePath}/3`));
        }
      } catch (e) {
        console.error(e);
      }
    }
    if (action?.action === 'destroy' && buildRects.length > 0) {
      if (animationRef.current) animationRef.current.stop();
      try {
        const userId = await AsyncStorage.getItem('userId');
        const guildId = await AsyncStorage.getItem('guildId');
        const basePath = `guilds/${guildId}/guildUsers/${userId}/culturalSettlements/constructedBuildings`;
        const cellRange = action.location || (action.locations ? action.locations.join(',') : '');
        const snap = await get(ref(database, basePath));
        if (snap.exists()) {
          const constructedBuildings = snap.val();
          const updates = {};
          Object.keys(constructedBuildings).forEach(key => {
            const rec = constructedBuildings[key];
            if (rec && rec.cellRange === cellRange) {
              updates[key] = null;
            }
          });
          if (Object.keys(updates).length > 0) {
            await update(ref(database, basePath), updates);
          }
        }
      } catch (e) {
        console.error(e);
      }
      setFinalizedRects(prev =>
        prev.filter(r => !buildRects.some(br => br.x === r.x && br.y === r.y && br.width === r.width && br.height === r.height))
      );
    }
    if (animationRef.current) {
      animationRef.current.stop();
      animationRef.current = null;
    }
    setBuildRects([]);
    buildOpacity.setValue(0);

    if (currentActionIndex < actions.length - 1) {
      setCurrentActionIndex(currentActionIndex + 1);
    } else {
      setCurrentActionIndex(actions.length);
    }
  };

  useLayoutEffect(() => {
    const action = actions[currentActionIndex];
    if (!action) return;
    if (animationRef.current) {
      animationRef.current.stop();
      animationRef.current = null;
    }
    setBuildRects([]);
    buildOpacity.setValue(0);

    if (action.action === 'move') {
      const fromRect = parseRange(action.from);
      const toRect = parseRange(action.to);
      if (fromRect && toRect) {
        setMoveRect({ width: fromRect.width, height: fromRect.height });
        animatedPos.setValue({ x: fromRect.x, y: fromRect.y });
        const anim = Animated.loop(
          Animated.sequence([
            Animated.timing(animatedPos, {
              toValue: { x: toRect.x, y: toRect.y },
              duration: 1000,
              useNativeDriver: false
            }),
            Animated.delay(1000),
            Animated.timing(animatedPos, {
              toValue: { x: fromRect.x, y: fromRect.y },
              duration: 0,
              useNativeDriver: false
            }),
            Animated.delay(1000)
          ])
        );
        animationRef.current = anim;
        anim.start();
      }
    } else if (action.action === 'build') {
      const locs = action.locations || (action.location ? [action.location] : []);
      const rects = locs.map(parseRange).filter(Boolean);
      setMoveRect(null);
      setBuildRects(rects);
      const anim = Animated.loop(
        Animated.sequence([
          Animated.timing(buildOpacity, {
            toValue: 1,
            duration: 1000,
            useNativeDriver: false
          }),
          Animated.delay(1000),
          Animated.timing(buildOpacity, {
            toValue: 0,
            duration: 0,
            useNativeDriver: false
          }),
        Animated.delay(1000)
      ])
      );
      animationRef.current = anim;
      anim.start();
    } else if (action.action === 'destroy') {
      const locs = action.locations || (action.location ? [action.location] : []);
      const rects = locs.map(parseRange).filter(Boolean);
      setMoveRect(null);
      setBuildRects(rects);
      buildOpacity.setValue(1);
      const anim = Animated.loop(
        Animated.sequence([
          Animated.delay(1000),
          Animated.timing(buildOpacity, {
            toValue: 0,
            duration: 1000,
            useNativeDriver: false
          }),
          Animated.delay(1000),
          Animated.timing(buildOpacity, {
            toValue: 1,
            duration: 0,
            useNativeDriver: false
          })
        ])
      );
      animationRef.current = anim;
      anim.start();
    } else {
      setMoveRect(null);
    }
    // eslint-disable-next-line react-hooks/exhaustive-deps
  }, [currentActionIndex]);

  return (
    <View style={styles.container}>
      <Text style={styles.title}>
        Тут логіка планувальника для {settlementName}
      </Text>
      <View
        style={[styles.mapContainer, { width: containerWidth, height: containerHeight }]}
        ref={containerRef}
        onLayout={handleContainerLayout}
      >
        <Animated.View
          style={{
            width: mapWidth,
            height: mapHeight,
            transform: [{ translateX: pan.x }, { translateY: pan.y }]
          }}
          {...panResponder.panHandlers}
        >
          <SvgXml xml={vikingMapXml} width={mapWidth} height={mapHeight} />
          {(moveRect || staticRect || buildRects.length > 0 || finalizedRects.length > 0) && (
            <Svg
              width={mapWidth}
              height={mapHeight}
              style={StyleSheet.absoluteFill}
            >
              {moveRect && (
                <AnimatedRect
                  x={animatedPos.x}
                  y={animatedPos.y}
                  width={moveRect.width}
                  height={moveRect.height}
                  fill="#8b0000"
                />
              )}
              {staticRect && (
                <Rect
                  x={staticRect.x}
                  y={staticRect.y}
                  width={staticRect.width}
                  height={staticRect.height}
                  fill="#8b0000"
                />
              )}
              {finalizedRects.map((r, idx) => {
                const action = actions[currentActionIndex];
                const hide =
                  action?.action === 'destroy' &&
                  buildRects.some(
                    br =>
                      br.x === r.x &&
                      br.y === r.y &&
                      br.width === r.width &&
                      br.height === r.height
                  );
                if (hide) return null;
                return (
                  <Rect
                    key={`f-${idx}`}
                    x={r.x}
                    y={r.y}
                    width={r.width}
                    height={r.height}
                    fill={r.color}
                  />
                );
              })}
              {buildRects.map((r, idx) => {
                const action = actions[currentActionIndex];
                const type = buildingTypes[action?.building] || 'residential';
                const color = buildingColors[type] || '#4b0082';
                return (
                  <AnimatedRect
                    key={idx}
                    x={r.x}
                    y={r.y}
                    width={r.width}
                    height={r.height}
                    fill={color}
                    style={{ opacity: buildOpacity }}
                  />
                );
              })}
            </Svg>
          )}
        </Animated.View>
      </View>
      {currentActionIndex < actions.length && (
        <View style={styles.inputRow}>
          <Text style={styles.actionText}>
            {actions[currentActionIndex].description}
          </Text>
          <TouchableOpacity style={styles.button} onPress={handleDone}>
            <Text style={{ color: '#fff' }}>Зроблено</Text>
          </TouchableOpacity>
        </View>
      )}
      {currentActionIndex >= actions.length && (
        <View style={styles.actionsContainer}>
          <TouchableOpacity
            style={styles.actionButton}
            onPress={() => Alert.alert('Вартість технологій', '')}
          >
            <Text style={styles.buttonText}>Вартість технологій</Text>
          </TouchableOpacity>
          <TouchableOpacity style={styles.actionButton} onPress={onClose}>
            <Text style={styles.buttonText}>Закінчити</Text>
          </TouchableOpacity>
        </View>
      )}
      <Modal
        animationType="slide"
        transparent={true}
        visible={obstacleModalVisible}
        onRequestClose={() => setObstacleModalVisible(false)}
      >
        <View style={styles.modalOverlay}>
          <View style={styles.modalContainer}>
            {selectedSector && (
              <>
                <Text style={styles.modalTitle}>{`Сектор ${selectedSector}`}</Text>
                <View
                  style={styles.modalSvgWrapper}
                  onLayout={e =>
                    setModalSvgSize({
                      width: e.nativeEvent.layout.width,
                      height: e.nativeEvent.layout.height
                    })
                  }
                >
                  <SvgXml
                    xml={getGroupSvgXml(selectedSector) || ''}
                    width="100%"
                    height="100%"
                  />
                  <Pressable
                    style={StyleSheet.absoluteFill}
                    onPress={handleModalPress}
                  />
                </View>
              </>
            )}
            <View style={styles.toggleRow}>
              <TouchableOpacity
                style={[styles.toggleButton, obstacleMode === 'horizontal' && styles.toggleActive]}
                disabled
                onPress={() =>
                  setObstacleMode(prev => (prev === 'horizontal' ? null : 'horizontal'))
                }
              >
                <Ionicons name="arrow-forward" size={24} color="#fff" />
              </TouchableOpacity>
              <TouchableOpacity
                style={[styles.toggleButton, obstacleMode === 'vertical' && styles.toggleActive]}
                disabled
                onPress={() =>
                  setObstacleMode(prev => (prev === 'vertical' ? null : 'vertical'))
                }
              >
                <Ionicons name="arrow-down" size={24} color="#fff" />
              </TouchableOpacity>
            </View>
            <View style={styles.modalButtonsRow}>
              <TouchableOpacity
                style={[styles.button, { flex: 1, marginRight: 8 }]}
                disabled
                onPress={() => setObstacleMode(null)}
              >
                <Text style={{ color: '#fff' }}>Очистити</Text>
              </TouchableOpacity>
              <TouchableOpacity
                style={[styles.button, { flex: 1 }]}
                disabled
                onPress={() => setObstacleModalVisible(false)}
              >
                <Text style={{ color: '#fff' }}>Застосувати</Text>
              </TouchableOpacity>
            </View>
          </View>
        </View>
      </Modal>
    </View>
  );
};

const styles = StyleSheet.create({
  container: { flex: 1, backgroundColor: '#fff', padding: 16 },
  title: { fontSize: 18, fontWeight: 'bold', marginBottom: 12 },
  loader: { flex: 1, justifyContent: 'center', alignItems: 'center' },
  mapContainer: {
    alignSelf: 'center',
    marginBottom: 16,
    overflow: 'hidden'
  },
  inputRow: {
    flexDirection: 'row',
    alignItems: 'center'
  },
  actionText: { flex: 1, marginRight: 8 },
  button: {
    backgroundColor: '#2196f3',
    paddingHorizontal: 12,
    paddingVertical: 8,
    borderRadius: 4
  },
  actionsContainer: { marginTop: 20, alignItems: 'center' },
  actionButton: {
    backgroundColor: '#2196f3',
    paddingHorizontal: 12,
    paddingVertical: 8,
    borderRadius: 4,
    marginBottom: 10,
    width: '60%',
    alignItems: 'center'
  },
  buttonText: { color: '#fff' },
  modalOverlay: {
    flex: 1,
    backgroundColor: 'rgba(0,0,0,0.5)',
    justifyContent: 'flex-end'
  },
  modalContainer: {
    backgroundColor: '#fff',
    borderTopLeftRadius: 10,
    borderTopRightRadius: 10,
    padding: 16,
    height: '50%'
  },
  modalTitle: {
    fontSize: 16,
    fontWeight: 'bold',
    textAlign: 'center',
    marginBottom: 8
  },
  modalButtonsRow: { flexDirection: 'row', marginTop: 8 },
  obstacleContainer: { marginTop: 12 },
  obstacleText: { marginBottom: 8 },
  toggleRow: { flexDirection: 'row', marginBottom: 8 },
  toggleButton: {
    backgroundColor: '#9e9e9e',
    padding: 8,
    marginRight: 8,
    borderRadius: 4
  },
  modalSvgWrapper: {
    width: '60%',
    height: '60%',
    alignSelf: 'center'
  },
  toggleActive: { backgroundColor: '#2196f3' }
});

export default CulturalPlanner;

